// Напишите программу вычисления модуля числа

Console.Write("Enter the number ");

var s = Console.ReadLine();

int N = int.Parse(s);

Console.WriteLine($"{Math.Abs(N)}"); // Добавили уже готовую математическую функцию