// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine("Enter the first number ");
int num1 = int.Parse(Console.ReadLine());

Console.WriteLine("Enter the second number ");
int num2 = int.Parse(Console.ReadLine());

Console.WriteLine("Enter the third number ");
int num2 = int.Parse(Console.ReadLine());